[
  {
    "post_title": "Samsung Galaxy S21: A Powerful and Compact Smartphone",
    "post_body": "The Samsung Galaxy S21 is a powerful and compact smartphone that comes with a 6.2 inch Dynamic AMOLED display, a Qualcomm Snapdragon 888 processor, and a triple-lens camera system. It runs on Android 11 and is available in various colors and storage capacities.",
    "date_created": "2021-01-29T14:20:00.000Z",
    "view_count": 20,
    "flag_count": 0,
    "tag_id": 3,
    "user_id": 1
  },
  {
    "post_title": "Samsung Galaxy S22: A Flagship Smartphone With Improved Performance",
    "post_body": "The Samsung Galaxy S22 is a flagship smartphone that features a 6.5 inch Dynamic AMOLED display, a Qualcomm Snapdragon 898 processor, and a quad-lens camera system. It runs on Android 12 and is available in various colors and storage capacities.",
    "date_created": "2022-06-15T09:45:00.000Z",
    "view_count": 15,
    "flag_count": 1,
    "tag_id": 2,
    "user_id": 2
  },
  {
    "post_title": "Samsung Galaxy S23: Flagship Smartphone With Impressive Camera System",
    "post_body": "The Samsung Galaxy S23 is a flagship smartphone with a 6.2 inch Dynamic AMOLED display, a Qualcomm Snapdragon 899 processor, and a quad-lens camera system. Running on Android 13, this phone offers great features and is available in various colors and storage capacities.",
    "date_created": "2023-02-10T16:30:00.000Z",
    "view_count": 5,
    "flag_count": 0,
    "tag_id": 1,
    "user_id": 3
  },
  {
    "post_title": "Samsung Galaxy S21+: A Larger and More Advanced Version of the S21",
    "post_body": "The Samsung Galaxy S21+ is a larger and more advanced version of the S21, with a 6.7-inch Dynamic AMOLED display and a triple-lens camera system. It also features a Qualcomm Snapdragon 888 processor, 5G connectivity, and up to 256GB of storage. The S21+ is available in Phantom Black and Phantom Silver color options. Overall, it's a great choice for those who want a big, powerful phone with excellent camera capabilities.",
    "date_created": "2023-04-15T12:00:00.000Z",
    "view_count": 0,
    "flag_count": 0,
    "tag_id": 1,
    "user_id": 4
  },
  {
    "post_title": "Samsung Galaxy S21 Ultra: The Ultimate Flagship Smartphone",
    "post_body": "The Samsung Galaxy S21 Ultra is a true powerhouse of a smartphone, boasting a massive 6.8-inch Dynamic AMOLED display, a quad-camera setup that includes a 108MP primary sensor, and 5G connectivity. The device also comes with a built-in S Pen that offers a seamless writing experience. With its cutting-edge features and top-of-the-line performance, the S21 Ultra is a true flagship smartphone that sets a new standard for the industry.",
    "date_created": "2023-04-15T15:30:00.000Z",
    "view_count": 0,
    "flag_count": 0,
    "tag_id": 2,
    "user_id": 5
  },
  {
    "post_title": "Samsung Galaxy Note20: A High-End Android Smartphone with Advanced S Pen Stylus",
    "post_body": "The Samsung Galaxy Note20 is a high-end Android smartphone with a 6.7-inch display, an advanced S Pen stylus, and 5G connectivity. It features a powerful Exynos 990 processor, 8GB of RAM, and 256GB of internal storage. The Note20's triple-camera setup includes a 12-megapixel primary camera, a 64-megapixel telephoto camera, and a 12-megapixel ultrawide camera. The phone's S Pen stylus has been improved with a faster response time and new air gestures that allow you to control the phone without touching it. The Note20 also features a large 4300mAh battery with fast charging capabilities, and runs on Samsung's One UI 2.5 based on Android 10.",
    "date_created": "2021-01-01T00:00:00.000Z",
    "view_count": 50,
    "flag_count": 2,
    "tag_id": 3,
    "user_id": 6
  },
  {
    "post_title": "Samsung Galaxy S20: A High-End Smartphone With Impressive Features",
    "post_body": "The Samsung Galaxy S20 is a high-end Android smartphone released in February 2020. It features a 6.2-inch Dynamic AMOLED display, a triple-camera setup with a 64-megapixel telephoto lens, and 5G connectivity. The phone runs on the powerful Snapdragon 865 processor and has 8GB of RAM and 128GB of internal storage. The battery capacity is 4000mAh and supports fast charging, wireless charging, and reverse wireless charging. With its premium design and impressive features, the Samsung Galaxy S20 is a great choice for those who want a top-of-the-line smartphone.",
    "date_created": "2022-04-16T12:00:00.000Z",
    "view_count": 0,
    "flag_count": 0,
    "tag_id": 5,
    "user_id": 7
  },
  {
    "post_title": "Samsung Galaxy S20+: A Bigger and Better Version of the S20",
    "post_body": "The Samsung Galaxy S20+ is a larger and more advanced version of the Galaxy S20. It features a 6.7-inch AMOLED display with a 3200x1440 resolution and a 120Hz refresh rate. The phone is powered by a Snapdragon 865 processor and comes with 8GB of RAM and 128GB of storage. The S20+ has a quad-camera setup that includes a 64MP telephoto lens, a 12MP wide-angle lens, and a 12MP ultrawide lens. The phone also has a depth sensor for better portrait shots. The S20+ has a 4500mAh battery and supports 25W fast charging. It also supports 5G connectivity.",
    "date_created": "2021-03-01T00:00:00.000Z",
    "view_count": 50,
    "flag_count": 2,
    "tag_id": 6,
    "user_id": 8
  },
  {
    "post_title": "Samsung Galaxy S20 Ultra: A Top-of-the-Line Phone with an Amazing Camera",
    "post_body": "The Samsung Galaxy S20 Ultra is one of the top-of-the-line phones in the S20 series, released in February 2020. It has a large 6.9-inch Dynamic AMOLED display, a powerful Qualcomm Snapdragon 865 processor, and 5G connectivity. But what really sets this phone apart is its amazing camera setup, which includes a 108-megapixel primary sensor, a 48-megapixel telephoto lens, a 12-megapixel ultra-wide lens, and a DepthVision camera. With these features, the Galaxy S20 Ultra is capable of capturing stunning photos and videos in any lighting condition. Other features of the Galaxy S20 Ultra include 12GB of RAM, up to 512GB of storage, and a large 5000mAh battery with fast charging and wireless charging capabilities.",
    "date_created": "2022-04-15T12:00:00.000Z",
    "view_count": 0,
    "flag_count": 0,
    "tag_id": 6,
    "user_id": 9
  }
]
